tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1619_tdd.h
#define SSP1BUF7                      522
#define ADD0                          523
#define ADD                           524
#define SSP1ADD0                      525
#define SSP1ADD                       526
#define ADD1                          527
#define SSP1ADD1                      528
#define ADD2                          529
#define SSP1ADD2                      530
#define ADD3                          531
#define SSP1ADD3                      532
#define ADD4                          533
#define SSP1ADD4                      534
#define ADD5                          535
#define SSP1ADD5                      536
#define ADD6                          537
#define SSP1ADD6                      538
#define ADD7                          539
#define SSP1ADD7                      540
#define SSP1MSK0                      541
#define SSP1MSK                       542
#define MSK0                          543
#define MSK                           544
#define SSP1MSK1                      545
#define MSK1                          546
#define SSP1MSK2                      547
#define MSK2                          548
#define SSP1MSK3                      549
#define MSK3                          550
#define SSP1MSK4                      551
#define MSK4                          552
#define SSP1MSK5                      553
#define MSK5                          554
#define SSP1MSK6                      555
#define MSK6                          556
#define SSP1MSK7                      557
#define MSK7                          558
#define SSP1STAT                      559
#define BF                            560
#define UA                            561
#define R_nW                          562
#define S                             563
#define P                             564
#define D_nA                          565
#define CKE                           566
#define SMP                           567
#define SSP1CON1                      568
#define SSPM0                         569
#define SSPM                          570
#define SSPM1                         571
#define SSPM2                         572
#define SSPM3                         573
#define CKP                           574
#define SSPEN                         575
#define SSPOV                         576
#define WCOL                          577
#define SSP1CON2                      578
#define SSP1CON2_SEN                  579
#define RSEN                          580
#define PEN                           581
#define RCEN                          582
#define ACKEN                         583
#define ACKDT                         584
#define ACKSTAT                       585
#define GCEN                          586
#define SSP1CON3                      587
#define DHEN                          588
#define AHEN                          589
#define SBCDE                         590
#define SDAHT                         591
#define BOEN                          592
#define SCIE                          593
#define PCIE                          594
#define ACKTIM                        595
#define ODCONA                        596
#define ODA0                          597
#define ODA1                          598
#define ODA2                          599
#define ODA4                          600
#define ODA5                          601
#define ODCONB                        602
#define ODB4                          603
#define ODB5                          604
#define ODB6                          605
#define ODB7                          606
#define ODCONC                        607
#define ODC0                          608
#define ODC1                          609
#define ODC2                          610
#define ODC3                          611
#define ODC4                          612
#define ODC5                          613
#define ODC6                          614
#define ODC7                          615
#define CCPR1L                        616
#define CCPR1L_RL                     617
#define CCPR1H                        618
#define CCPR1H_RH                     619
#define CCP1CON                       620
#define CCP1MODE0                     621
#define CCP1CON_MODE0                 622
#define CCP1CON_MODE                  623
#define CCP1MODE                      624
#define CCP1MODE1                     625
#define CCP1CON_MODE1                 626
#define CCP1MODE2                     627
#define CCP1CON_MODE2                 628
#define CCP1MODE3                     629
#define CCP1CON_MODE3                 630
#define CCP1CON_FMT                   631
#define CCP1FMT                       632
#define CCP1CON_OUT                   633
#define CCP1OUT                       634
#define CCP1EN                        635
#define CCP1CON_EN                    636
#define CCP1CAP                       637
#define CCP1CTS0                      638
#define CCP1CAP_CTS                   639
#define CCP1CAP_CTS0                  640
#define CCP1CTS                       641
#define CCP1CTS1                      642
#define CCP1CAP_CTS1                  643
#define CCP1CTS2                      644
#define CCP1CAP_CTS2                  645
#define CCPR2L                        646
#define CCPR2L_RL                     647
#define CCPR2H                        648
#define CCPR2H_RH                     649
#define CCP2CON                       650
#define CCP2MODE                      651
#define CCP2MODE0                     652
#define CCP2CON_MODE0                 653
#define CCP2CON_MODE                  654
#define CCP2MODE1                     655
#define CCP2CON_MODE1                 656
#define CCP2MODE2                     657
#define CCP2CON_MODE2                 658
#define CCP2MODE3                     659
#define CCP2CON_MODE3                 660
#define CCP2FMT                       661
#define CCP2CON_FMT                   662
#define CCP2OUT                       663
#define CCP2CON_OUT                   664
#define CCP2EN                        665
#define CCP2CON_EN                    666
#define CCP2CAP                       667
#define CCP2CAP_CTS                   668
#define CCP2CAP_CTS0                  669
#define CCP2CTS                       670
#define CCP2CTS0                      671
#define CCP2CAP_CTS1                  672
#define CCP2CTS1                      673
#define CCP2CAP_CTS2                  674
#define CCP2CTS2                      675
#define CCPTMRS                       676
#define CCP1TSEL0                     677
#define CCP1TSEL                      678
#define CCP1TSEL1                     679
#define CCP2TSEL0                     680
#define CCP2TSEL                      681
#define CCP2TSEL1                     682
#define P3TSEL                        683
#define P3TSEL0                       684
#define P3TSEL1                       685
#define P4TSEL0                       686
#define P4TSEL                        687
#define P4TSEL1                       688
#define SLRCONA                       689
#define SLRA0                         690
#define SLRA1                         691
#define SLRA2                         692
#define SLRA4                         693
#define SLRA5                         694
#define SLRCONB                       695
#define SLRB4                         696
#define SLRB5                         697
#define SLRB6                         698
#define SLRB7                         699
#define SLRCONC                       700
#define SLRC0                         701
#define SLRC1                         702
#define SLRC2                         703
#define SLRC3                         704
#define SLRC4                         705
#define SLRC5                         706
#define SLRC6                         707
#define SLRC7                         708
#define INLVLA                        709
#define INLVLA0                       710
#define INLVLA1                       711
#define INLVLA2                       712
#define INLVLA3                       713
#define INLVLA4                       714
#define INLVLA5                       715
#define INLVLB                        716
#define INLVLB4                       717
#define INLVLB5                       718
#define INLVLB6                       719
#define INLVLB7                       720
#define INLVLC                        721
#define INLVLC0                       722
#define INLVLC1                       723
#define INLVLC2                       724
#define INLVLC3                       725
#define INLVLC4                       726
#define INLVLC5                       727
#define INLVLC6                       728
#define INLVLC7                       729
#define IOCAP                         730
#define IOCAP0                        731
#define IOCAP1                        732
#define IOCAP2                        733
#define IOCAP3                        734
#define IOCAP4                        735
#define IOCAP5                        736
#define IOCAN0                        737
#define IOCAN                         738
#define IOCAN1                        739
#define IOCAN2                        740
#define IOCAN3                        741
#define IOCAN4                        742
#define IOCAN5                        743
#define IOCAF0                        744
#define IOCAF                         745
#define IOCAF1                        746
#define IOCAF2                        747
#define IOCAF3                        748
#define IOCAF4                        749
#define IOCAF5                        750
#define IOCBP                         751
#define IOCBP4                        752
#define IOCBP5                        753
#define IOCBP6                        754
#define IOCBP7                        755
#define IOCBN                         756
#define IOCBN4                        757
#define IOCBN5                        758
#define IOCBN6                        759
#define IOCBN7                        760
#define IOCBF                         761
#define IOCBF4                        762
#define IOCBF5                        763
#define IOCBF6                        764
#define IOCBF7                        765
#define IOCCP                         766
#define IOCCP0                        767
#define IOCCP1                        768
#define IOCCP2                        769
#define IOCCP3                        770
#define IOCCP4                        771
#define IOCCP5                        772
#define IOCCP6                        773
#define IOCCP7                        774
#define IOCCN                         775
#define IOCCN0                        776
#define IOCCN1                        777
#define IOCCN2                        778
#define IOCCN3                        779
#define IOCCN4                        780
#define IOCCN5                        781
#define IOCCN6                        782
#define IOCCN7                        783
#define IOCCF                         784
#define IOCCF0                        785
#define IOCCF1                        786
#define IOCCF2                        787
#define IOCCF3                        788
#define IOCCF4                        789
#define IOCCF5                        790
#define IOCCF6                        791
#define IOCCF7                        792
#define HIDRVC                        793
#define HIDC4                         794
#define HIDC5                         795
#define T4TMR                         796
#define TMR4                          797
#define T4TMR_TMR                     798
#define T4PR_PR                       799
#define T4PR                          800
#define T4CON                         801
#define T4OUTPS0                      802
#define T4CON_OUTPS                   803
#define T4OUTPS                       804
#define T4CON_OUTPS0                  805
#define T4OUTPS1                      806
#define T4CON_OUTPS1                  807
#define T4CON_OUTPS2                  808
#define T4OUTPS2                      809
#define T4OUTPS3                      810
#define T4CON_OUTPS3                  811
#define T4CON_CKPS0                   812
#define T4CKPS0                       813
#define T4CON_CKPS                    814
#define T4CKPS                        815
#define T4CKPS1                       816
#define T4CON_CKPS1                   817
#define T4CKPS2                       818
#define T4CON_CKPS2                   819
#define T4ON                          820
#define T4CON_ON                      821
#define TMR4ON                        822
#define T4HLT                         823
#define T4MODE                        824
#define T4HLT_MODE                    825
#define T4HLT_MODE0                   826
#define T4MODE0                       827
#define T4HLT_MODE1                   828
#define T4MODE1                       829
#define T4HLT_MODE2                   830
#define T4MODE2                       831
#define T4HLT_MODE3                   832
#define T4MODE3                       833
#define T4HLT_MODE4                   834
#define T4MODE4                       835
#define T4CKSYNC                      836
#define T4HLT_CKSYNC                  837
#define T4HLT_CKPOL                   838
#define T4CKPOL                       839
#define T4PSYNC                       840
#define T4HLT_PSYNC                   841
#define T4CLKCON                      842
#define T4CS                          843
#define T4CLKCON_CS                   844
#define T4CS0                         845
#define T4CLKCON_CS0                  846
#define T4CS1                         847
#define T4CLKCON_CS1                  848
#define T4CS2                         849
#define T4CLKCON_CS2                  850
#define T4CS3                         851
#define T4CLKCON_CS3                  852
#define T4RST                         853
#define T4RSEL0                       854
#define T4RSEL                        855
#define T4RST_RSEL                    856
#define T4RST_RSEL0                   857
#define T4RSEL1                       858
#define T4RST_RSEL1                   859
#define T4RSEL2                       860
#define T4RST_RSEL2                   861
#define T4RSEL3                       862
#define T4RST_RSEL3                   863
#define T6TMR                         864
#define TMR6                          865
#define T6TMR_TMR                     866
#define T6PR_PR                       867
#define T6PR                          868
#define T6CON                         869
#define T6CON_OUTPS0                  870
#define T6OUTPS                       871
#define T6CON_OUTPS                   872
#define T6OUTPS0                      873
#define T6CON_OUTPS1                  874
#define T6OUTPS1                      875
#define T6CON_OUTPS2                  876
#define T6OUTPS2                      877
#define T6CON_OUTPS3                  878
#define T6OUTPS3                      879
#define T6CON_CKPS0                   880
#define T6CKPS                        881
#define T6CKPS0                       882
#define T6CON_CKPS                    883
#define T6CON_CKPS1                   884
#define T6CKPS1                       885
#define T6CON_CKPS2                   886
#define T6CKPS2                       887
#define TMR6ON                        888
#define T6ON                          889
#define T6CON_ON                      890
#define T6HLT                         891
#define T6MODE0                       892
#define T6HLT_MODE0                   893
#define T6HLT_MODE                    894
#define T6MODE                        895
#define T6HLT_MODE1                   896
#define T6MODE1                       897
#define T6HLT_MODE2                   898
#define T6MODE2                       899
#define T6HLT_MODE3                   900
#define T6MODE3                       901
#define T6MODE4                       902
#define T6HLT_MODE4                   903
#define T6CKSYNC                      904
#define T6HLT_CKSYNC                  905
#define T6CKPOL                       906
#define T6HLT_CKPOL                   907
#define T6PSYNC                       908
#define T6HLT_PSYNC                   909
#define T6CLKCON                      910
#define T6CS                          911
#define T6CLKCON_CS                   912
#define T6CLKCON_CS0                  913
#define T6CS0                         914
#define T6CLKCON_CS1                  915
#define T6CS1                         916
#define T6CLKCON_CS2                  917
#define T6CS2                         918
#define T6CLKCON_CS3                  919
#define T6CS3                         920
#define T6RST                         921
#define T6RST_RSEL                    922
#define T6RST_RSEL0                   923
#define T6RSEL                        924
#define T6RSEL0                       925
#define T6RST_RSEL1                   926
#define T6RSEL1                       927
#define T6RSEL2                       928
#define T6RST_RSEL2                   929
#define T6RST_RSEL3                   930
#define T6RSEL3                       931
#define TMR3L                         932
#define TMR3H                         933
#define T3CON                         934
#define TMR3ON                        935
#define T3SYNC                        936
#define T3CKPS                        937
#define T3CKPS0                       938
#define T3CKPS1                       939
#define TMR3CS0                       940
#define TMR3CS                        941
#define TMR3CS1                       942
#define T3GCON                        943
#define T3GSS0                        944
#define T3GSS                         945
#define T3GSS1                        946
#define T3GVAL                        947
#define T3GGO_nDONE                   948
#define T3GSPM                        949
#define T3GTM                         950
#define T3GPOL                        951
#define TMR3GE                        952
#define TMR5L                         953
#define TMR5H                         954
#define T5CON                         955
#define TMR5ON                        956
#define T5SYNC                        957
#define T5CKPS                        958
#define T5CKPS0                       959
#define T5CKPS1                       960
#define TMR5CS0                       961
#define TMR5CS                        962
#define TMR5CS1                       963
#define T5GCON                        964
#define T5GSS                         965
#define T5GSS0                        966
#define T5GSS1                        967
#define T5GVAL                        968
#define T5GGO_nDONE                   969
#define T5GSPM                        970
#define T5GTM                         971
#define T5GPOL                        972
#define TMR5GE                        973
#define PID1SETL                      974
#define PID1SET0                      975
#define SET0                          976
#define PID1SET1                      977
#define SET1                          978
#define SET2                          979
#define PID1SET2                      980
#define SET3                          981
#define PID1SET3                      982
#define SET4                          983
#define PID1SET4                      984
#define SET5                          985
#define PID1SET5                      986
#define SET6                          987
#define PID1SET6                      988
#define SET7                          989
#define PID1SET7                      990
#define PID1SETH                      991
#define SET8                          992
#define PID1SET8                      993
#define SET9                          994
#define PID1SET9                      995
#define SET10                         996
#define PID1SET10                     997
#define SET11                         998
#define PID1SET11                     999
#define SET12                         1000
#define PID1SET12                     1001
#define SET13                         1002
#define PID1SET13                     1003
#define SET14                         1004
#define PID1SET14                     1005
#define SET15                         1006
#define PID1SET15                     1007
#define PID1INL                       1008
#define IN0                           1009
#define PID1IN0                       1010
#define IN1                           1011
#define PID1IN1                       1012
#define IN2                           1013
#define PID1IN2                       1014
#define IN3                           1015
#define PID1IN3                       1016
#define IN4                           1017
#define PID1IN4                       1018
#define IN5                           1019
#define PID1IN5                       1020
#define IN6                           1021
#define PID1IN6                       1022
#define IN7                           1023
#define PID1IN7                       1024
#define PID1INH                       1025
#define IN8                           1026
#define PID1IN8                       1027
#define IN9                           1028
#define PID1IN9                       1029
#define PID1IN10                      1030
#define IN10                          1031
#define PID1IN11                      1032
#define IN11                          1033
#define PID1IN12                      1034
#define IN12                          1035
#define PID1IN13                      1036
#define IN13                          1037
#define PID1IN14                      1038
#define IN14                          1039
#define IN15                          1040
#define PID1IN15                      1041
#define PID1K1L                       1042
#define K10                           1043
#define PID1K10                       1044
#define K11                           1045
#define PID1K11                       1046
#define K12                           1047
#define PID1K12                       1048
#define K13                           1049
#define PID1K13                       1050
#define K14                           1051
#define PID1K14                       1052
#define K15                           1053
#define PID1K15                       1054
#define K16                           1055
#define PID1K16                       1056
#define K17                           1057
#define PID1K17                       1058
#define PID1K1H                       1059
#define K18                           1060
#define PID1K18                       1061
#define K19                           1062
#define PID1K19                       1063
#define PID1K110                      1064
#define K110                          1065
#define PID1K111                      1066
#define K111                          1067
#define PID1K112                      1068
#define K112                          1069
#define PID1K113                      1070
#define K113                          1071
#define PID1K114                      1072
#define K114                          1073
#define PID1K115                      1074
#define K115                          1075
#define PID1K2L                       1076
#define K20                           1077
#define PID1K20                       1078
#define K21                           1079
#define PID1K21                       1080
#define K22                           1081
#define PID1K22                       1082
#define K23                           1083
#define PID1K23                       1084
#define K24                           1085
#define PID1K24                       1086
#define K25                           1087
#define PID1K25                       1088
#define K26                           1089
#define PID1K26                       1090
