tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1619_tdd.h
#define K27                           1091
#define PID1K27                       1092
#define PID1K2H                       1093
#define K28                           1094
#define PID1K28                       1095
#define K29                           1096
#define PID1K29                       1097
#define PID1K210                      1098
#define K210                          1099
#define PID1K211                      1100
#define K211                          1101
#define PID1K212                      1102
#define K212                          1103
#define PID1K213                      1104
#define K213                          1105
#define PID1K214                      1106
#define K214                          1107
#define PID1K215                      1108
#define K215                          1109
#define PID1K3L                       1110
#define K30                           1111
#define PID1K30                       1112
#define K31                           1113
#define PID1K31                       1114
#define K32                           1115
#define PID1K32                       1116
#define K33                           1117
#define PID1K33                       1118
#define K34                           1119
#define PID1K34                       1120
#define K35                           1121
#define PID1K35                       1122
#define K36                           1123
#define PID1K36                       1124
#define K37                           1125
#define PID1K37                       1126
#define PID1K3H                       1127
#define K38                           1128
#define PID1K38                       1129
#define PID1K39                       1130
#define K39                           1131
#define K310                          1132
#define PID1K310                      1133
#define K311                          1134
#define PID1K311                      1135
#define K312                          1136
#define PID1K312                      1137
#define K313                          1138
#define PID1K313                      1139
#define K314                          1140
#define PID1K314                      1141
#define K315                          1142
#define PID1K315                      1143
#define PID1OUTLL                     1144
#define OUT0                          1145
#define PID1OUT0                      1146
#define OUT1                          1147
#define PID1OUT1                      1148
#define OUT2                          1149
#define PID1OUT2                      1150
#define OUT3                          1151
#define PID1OUT3                      1152
#define OUT4                          1153
#define PID1OUT4                      1154
#define OUT5                          1155
#define PID1OUT5                      1156
#define OUT6                          1157
#define PID1OUT6                      1158
#define OUT7                          1159
#define PID1OUT7                      1160
#define PID1OUTLH                     1161
#define OUT8                          1162
#define PID1OUT8                      1163
#define OUT9                          1164
#define PID1OUT9                      1165
#define PID1OUT10                     1166
#define OUT10                         1167
#define PID1OUT11                     1168
#define OUT11                         1169
#define OUT12                         1170
#define PID1OUT12                     1171
#define OUT13                         1172
#define PID1OUT13                     1173
#define PID1OUT14                     1174
#define OUT14                         1175
#define PID1OUT15                     1176
#define OUT15                         1177
#define PID1OUTHL                     1178
#define PID1OUT16                     1179
#define OUT16                         1180
#define PID1OUT17                     1181
#define OUT17                         1182
#define OUT18                         1183
#define PID1OUT18                     1184
#define OUT19                         1185
#define PID1OUT19                     1186
#define OUT20                         1187
#define PID1OUT20                     1188
#define OUT21                         1189
#define PID1OUT21                     1190
#define OUT22                         1191
#define PID1OUT22                     1192
#define OUT23                         1193
#define PID1OUT23                     1194
#define PID1OUTHH                     1195
#define OUT24                         1196
#define PID1OUT24                     1197
#define OUT25                         1198
#define PID1OUT25                     1199
#define OUT26                         1200
#define PID1OUT26                     1201
#define OUT27                         1202
#define PID1OUT27                     1203
#define OUT28                         1204
#define PID1OUT28                     1205
#define OUT29                         1206
#define PID1OUT29                     1207
#define PID1OUT30                     1208
#define OUT30                         1209
#define OUT31                         1210
#define PID1OUT31                     1211
#define PID1OUTU                      1212
#define OUT32                         1213
#define PID1OUT32                     1214
#define OUT33                         1215
#define PID1OUT33                     1216
#define OUT34                         1217
#define PID1OUT34                     1218
#define OUT35                         1219
#define PID1OUT35                     1220
#define PID1Z1L                       1221
#define PID1Z10                       1222
#define Z10                           1223
#define PID1Z11                       1224
#define Z11                           1225
#define PID1Z12                       1226
#define Z12                           1227
#define PID1Z13                       1228
#define Z13                           1229
#define PID1Z14                       1230
#define Z14                           1231
#define PID1Z15                       1232
#define Z15                           1233
#define PID1Z16                       1234
#define Z16                           1235
#define PID1Z17                       1236
#define Z17                           1237
#define PID1Z1H                       1238
#define Z18                           1239
#define PID1Z18                       1240
#define Z19                           1241
#define PID1Z19                       1242
#define Z110                          1243
#define PID1Z110                      1244
#define Z111                          1245
#define PID1Z111                      1246
#define Z112                          1247
#define PID1Z112                      1248
#define Z113                          1249
#define PID1Z113                      1250
#define Z114                          1251
#define PID1Z114                      1252
#define Z115                          1253
#define PID1Z115                      1254
#define PID1Z1U                       1255
#define Z116                          1256
#define PID1Z116                      1257
#define PID1Z2L                       1258
#define Z20                           1259
#define PID1Z20                       1260
#define Z21                           1261
#define PID1Z21                       1262
#define Z22                           1263
#define PID1Z22                       1264
#define Z23                           1265
#define PID1Z23                       1266
#define Z24                           1267
#define PID1Z24                       1268
#define Z25                           1269
#define PID1Z25                       1270
#define Z26                           1271
#define PID1Z26                       1272
#define Z27                           1273
#define PID1Z27                       1274
#define PID1Z2H                       1275
#define Z28                           1276
#define PID1Z28                       1277
#define Z29                           1278
#define PID1Z29                       1279
#define PID1Z210                      1280
#define Z210                          1281
#define PID1Z211                      1282
#define Z211                          1283
#define PID1Z212                      1284
#define Z212                          1285
#define PID1Z213                      1286
#define Z213                          1287
#define PID1Z214                      1288
#define Z214                          1289
#define PID1Z215                      1290
#define Z215                          1291
#define PID1Z2U                       1292
#define PID1Z216                      1293
#define Z216                          1294
#define PID1ACCLL                     1295
#define PID1ACCLL_ACC0                1296
#define PID1ACC0                      1297
#define PID1ACCLL_ACC1                1298
#define PID1ACC1                      1299
#define PID1ACCLL_ACC2                1300
#define PID1ACC2                      1301
#define PID1ACCLL_ACC3                1302
#define PID1ACC3                      1303
#define PID1ACCLL_ACC4                1304
#define PID1ACC4                      1305
#define PID1ACCLL_ACC5                1306
#define PID1ACC5                      1307
#define PID1ACCLL_ACC6                1308
#define PID1ACC6                      1309
#define PID1ACCLL_ACC7                1310
#define PID1ACC7                      1311
#define PID1ACCLH                     1312
#define PID1ACCLH_ACC8                1313
#define PID1ACC8                      1314
#define PID1ACCLH_ACC9                1315
#define PID1ACC9                      1316
#define PID1ACC10                     1317
#define PID1ACCLH_ACC10               1318
#define PID1ACC11                     1319
#define PID1ACCLH_ACC11               1320
#define PID1ACC12                     1321
#define PID1ACCLH_ACC12               1322
#define PID1ACC13                     1323
#define PID1ACCLH_ACC13               1324
#define PID1ACC14                     1325
#define PID1ACCLH_ACC14               1326
#define PID1ACC15                     1327
#define PID1ACCLH_ACC15               1328
#define PID1ACCHL                     1329
#define PID1ACC16                     1330
#define ACC16                         1331
#define PID1ACC17                     1332
#define ACC17                         1333
#define PID1ACC18                     1334
#define ACC18                         1335
#define PID1ACC19                     1336
#define ACC19                         1337
#define ACC20                         1338
#define PID1ACC20                     1339
#define ACC21                         1340
#define PID1ACC21                     1341
#define ACC22                         1342
#define PID1ACC22                     1343
#define ACC23                         1344
#define PID1ACC23                     1345
#define PID1ACCHH                     1346
#define ACC24                         1347
#define PID1ACC24                     1348
#define ACC25                         1349
#define PID1ACC25                     1350
#define ACC26                         1351
#define PID1ACC26                     1352
#define ACC27                         1353
#define PID1ACC27                     1354
#define ACC28                         1355
#define PID1ACC28                     1356
#define ACC29                         1357
#define PID1ACC29                     1358
#define PID1ACC30                     1359
#define ACC30                         1360
#define ACC31                         1361
#define PID1ACC31                     1362
#define PID1ACCU                      1363
#define ACC32                         1364
#define PID1ACC32                     1365
#define ACC33                         1366
#define PID1ACC33                     1367
#define PID1ACC34                     1368
#define ACC34                         1369
#define PID1CON                       1370
#define PID1CON_MODE0                 1371
#define PID1MODE0                     1372
#define PID1CON_MODE                  1373
#define PID1MODE                      1374
#define PID1CON_MODE1                 1375
#define PID1MODE1                     1376
#define PID1CON_MODE2                 1377
#define PID1MODE2                     1378
#define PID1CON_BUSY                  1379
#define PID1BUSY                      1380
#define PID1EN                        1381
#define PID1CON_EN                    1382
#define PWM3DCL                       1383
#define PWM3DC0                       1384
#define PWM3DCL_PWMPW0                1385
#define PWM3DCL_DC0                   1386
#define PWM3DCL_DC                    1387
#define PWM3DC1                       1388
#define PWM3DCL_PWMPW1                1389
#define PWM3DCL_DC1                   1390
#define PWM3DCH                       1391
#define PWM3DC2                       1392
#define PWM3DCH_DC2                   1393
#define PWM3DCH_DC                    1394
#define PWM3DCH_PWMPW2                1395
#define PWM3DC3                       1396
#define PWM3DCH_DC3                   1397
#define PWM3DCH_PWMPW3                1398
#define PWM3DC4                       1399
#define PWM3DCH_DC4                   1400
#define PWM3DCH_PWMPW4                1401
#define PWM3DC5                       1402
#define PWM3DCH_DC5                   1403
#define PWM3DCH_PWMPW5                1404
#define PWM3DC6                       1405
#define PWM3DCH_DC6                   1406
#define PWM3DCH_PWMPW6                1407
#define PWM3DC7                       1408
#define PWM3DCH_DC7                   1409
#define PWM3DCH_PWMPW7                1410
#define PWM3DC8                       1411
#define PWM3DCH_DC8                   1412
#define PWM3DCH_PWMPW8                1413
#define PWM3DC9                       1414
#define PWM3DCH_DC9                   1415
#define PWM3DCH_PWMPW9                1416
#define PWM3CON                       1417
#define PWM3CON_POL                   1418
#define PWM3POL                       1419
#define PWM3CON_OUT                   1420
#define PWM3OUT                       1421
#define PWM3EN                        1422
#define PWM3CON_EN                    1423
#define PWM4DCL                       1424
#define PWM4DCL_PWMPW0                1425
#define PWM4DCL_DC                    1426
#define PWM4DC0                       1427
#define PWM4DCL_DC0                   1428
#define PWM4DCL_PWMPW1                1429
#define PWM4DC1                       1430
#define PWM4DCL_DC1                   1431
#define PWM4DCH                       1432
#define PWM4DCH_PWMPW2                1433
#define PWM4DCH_DC                    1434
#define PWM4DC2                       1435
#define PWM4DCH_DC2                   1436
#define PWM4DCH_PWMPW3                1437
#define PWM4DC3                       1438
#define PWM4DCH_DC3                   1439
#define PWM4DCH_PWMPW4                1440
#define PWM4DC4                       1441
#define PWM4DCH_DC4                   1442
#define PWM4DCH_PWMPW5                1443
#define PWM4DC5                       1444
#define PWM4DCH_DC5                   1445
#define PWM4DCH_PWMPW6                1446
#define PWM4DC6                       1447
#define PWM4DCH_DC6                   1448
#define PWM4DCH_PWMPW7                1449
#define PWM4DC7                       1450
#define PWM4DCH_DC7                   1451
#define PWM4DCH_PWMPW8                1452
#define PWM4DC8                       1453
#define PWM4DCH_DC8                   1454
#define PWM4DCH_PWMPW9                1455
#define PWM4DC9                       1456
#define PWM4DCH_DC9                   1457
#define PWM4CON                       1458
#define PWM4POL                       1459
#define PWM4CON_POL                   1460
#define PWM4CON_OUT                   1461
#define PWM4OUT                       1462
#define PWM4EN                        1463
#define PWM4CON_EN                    1464
#define CWG1DBR0                      1465
#define CWG1DBR                       1466
#define DBR                           1467
#define DBR0                          1468
#define CWG1DBR1                      1469
#define DBR1                          1470
#define CWG1DBR2                      1471
#define DBR2                          1472
#define CWG1DBR3                      1473
#define DBR3                          1474
#define CWG1DBR4                      1475
#define DBR4                          1476
#define CWG1DBR5                      1477
#define DBR5                          1478
#define CWG1DBF                       1479
#define CWG1DBF0                      1480
#define DBF                           1481
#define DBF0                          1482
#define CWG1DBF1                      1483
#define DBF1                          1484
#define CWG1DBF2                      1485
#define DBF2                          1486
#define CWG1DBF3                      1487
#define DBF3                          1488
#define CWG1DBF4                      1489
#define DBF4                          1490
#define DBF5                          1491
#define CWG1DBF5                      1492
#define CWG1AS0                       1493
#define CWG1LSAC                      1494
#define LSAC                          1495
#define LSAC0                         1496
#define CWG1LSAC0                     1497
#define LSAC1                         1498
#define CWG1LSAC1                     1499
#define LSBD0                         1500
#define CWG1LSBD0                     1501
#define LSBD                          1502
#define CWG1LSBD                      1503
#define LSBD1                         1504
#define CWG1LSBD1                     1505
#define CWG1REN                       1506
#define REN                           1507
#define CWG1SHUTDOWN                  1508
#define SHUTDOWN                      1509
#define CWG1AS1                       1510
#define INAS                          1511
#define CWG1INAS                      1512
#define C1AS                          1513
#define CWG1C1AS                      1514
#define C2AS                          1515
#define CWG1C2AS                      1516
#define TMR2AS                        1517
#define CWG1TMR2AS                    1518
#define CWG1TMR4AS                    1519
#define TMR4AS                        1520
#define CWG1TMR6AS                    1521
#define TMR6AS                        1522
#define CWG1OCON0                     1523
#define CWG1STRA                      1524
#define STRA                          1525
#define STRB                          1526
#define CWG1STRB                      1527
#define CWG1STRC                      1528
#define STRC                          1529
#define CWG1STRD                      1530
#define STRD                          1531
#define OVRA                          1532
#define CWG1OVRA                      1533
#define CWG1OVRB                      1534
#define OVRB                          1535
#define OVRC                          1536
#define CWG1OVRC                      1537
#define OVRD                          1538
#define CWG1OVRD                      1539
#define CWG1CON0                      1540
#define CWG1MODE0                     1541
#define CWG1CON0_MODE0                1542
#define CWG1MODE                      1543
#define CWG1CON0_MODE                 1544
#define CWG1MODE1                     1545
#define CWG1CON0_MODE1                1546
#define CWG1MODE2                     1547
#define CWG1CON0_MODE2                1548
#define LD                            1549
#define CWG1LD                        1550
#define CWG1CON0_EN                   1551
#define CWG1EN                        1552
#define G1EN                          1553
#define CWG1CON1                      1554
#define CWG1POLA                      1555
#define POLA                          1556
#define CWG1POLB                      1557
#define POLB                          1558
#define CWG1POLC                      1559
#define POLC                          1560
#define CWG1POLD                      1561
#define POLD                          1562
#define IN                            1563
#define CWG1IN                        1564
#define CWG1CLKCON                    1565
#define CWG1CLKCON_CS                 1566
#define CWG1CS                        1567
#define CWG1ISM                       1568
#define CWG1IS                        1569
#define IS                            1570
#define IS0                           1571
#define CWG1IS0                       1572
#define CWG1IS1                       1573
#define IS1                           1574
#define IS2                           1575
#define CWG1IS2                       1576
#define IS3                           1577
#define CWG1IS3                       1578
#define WDTCON0                       1579
#define WDTCON0_SEN                   1580
#define SWDTEN                        1581
#define WDTSEN                        1582
#define WDTPS                         1583
#define WDTPS0                        1584
#define WDTPS1                        1585
#define WDTPS2                        1586
#define WDTPS3                        1587
#define WDTPS4                        1588
#define WDTCON1                       1589
#define WDTWINDOW0                    1590
#define WINDOW0                       1591
#define WINDOW                        1592
#define WDTWINDOW                     1593
#define WDTWINDOW1                    1594
#define WINDOW1                       1595
#define WDTWINDOW2                    1596
#define WINDOW2                       1597
#define WDTCS                         1598
#define WDTCS0                        1599
#define WDTCS1                        1600
#define WDTCS2                        1601
#define WDTPSL                        1602
#define WDTPSL_WDTPSCNT               1603
#define WDTPSL_PSCNT                  1604
#define WDTPSCNT0                     1605
#define PSCNT0                        1606
#define WDTPSCNT1                     1607
#define PSCNT1                        1608
#define WDTPSCNT2                     1609
#define PSCNT2                        1610
#define WDTPSCNT3                     1611
#define PSCNT3                        1612
#define WDTPSCNT4                     1613
#define PSCNT4                        1614
#define WDTPSCNT5                     1615
#define PSCNT5                        1616
#define WDTPSCNT6                     1617
#define PSCNT6                        1618
#define WDTPSCNT7                     1619
#define PSCNT7                        1620
#define WDTPSH                        1621
#define PSCNT8                        1622
#define WDTPSH_WDTPSCNT               1623
#define WDTPSH_PSCNT                  1624
#define WDTPSCNT8                     1625
#define PSCNT9                        1626
#define WDTPSCNT9                     1627
#define PSCNT10                       1628
#define WDTPSCNT10                    1629
#define PSCNT11                       1630
#define WDTPSCNT11                    1631
#define PSCNT12                       1632
#define WDTPSCNT12                    1633
#define PSCNT13                       1634
#define WDTPSCNT13                    1635
#define PSCNT14                       1636
#define WDTPSCNT14                    1637
#define PSCNT15                       1638
#define WDTPSCNT15                    1639
#define PSCNT16                       1640
#define WDTPSCNT16                    1641
#define WDTPSCNT17                    1642
#define PSCNT17                       1643
#define STATE                         1644
#define WDTSTATE                      1645
#define WDTTMR                        1646
#define WDTTMR0                       1647
#define WDTTMR1                       1648
