tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1619_tdd.h
#define WDTTMR2                       1649
#define WDTTMR3                       1650
#define WDTTMR4                       1651
#define SCANLADRL                     1652
#define SCANLADRL_LADR                1653
#define LDAR0                         1654
#define SCANLADRL_SCANLADR            1655
#define SCANLADR0                     1656
#define SCANLADR1                     1657
#define LDAR1                         1658
#define LADR2                         1659
#define SCANLADR2                     1660
#define LADR3                         1661
#define SCANLADR3                     1662
#define LADR4                         1663
#define SCANLADR4                     1664
#define LADR5                         1665
#define SCANLADR5                     1666
#define SCANLADR6                     1667
#define LADR6                         1668
#define LADR7                         1669
#define SCANLADR7                     1670
#define SCANLADRH                     1671
#define LADR8                         1672
#define SCANLADRH_SCANLADR            1673
#define SCANLADR8                     1674
#define SCANLADRH_LADR                1675
#define LADR9                         1676
#define SCANLADR9                     1677
#define LADR10                        1678
#define SCANLADR10                    1679
#define SCANLADR11                    1680
#define LADR11                        1681
#define LADR12                        1682
#define SCANLADR12                    1683
#define LADR13                        1684
#define SCANLADR13                    1685
#define LADR14                        1686
#define SCANLADR14                    1687
#define LADR15                        1688
#define SCANLADR15                    1689
#define SCANHADRL                     1690
#define SCANHADR0                     1691
#define HADR0                         1692
#define SCANHADRL_HADR                1693
#define SCANHADRL_SCANHADR            1694
#define SCANHADR1                     1695
#define HADR1                         1696
#define SCANHADR2                     1697
#define HARD2                         1698
#define SCANHADR3                     1699
#define HADR3                         1700
#define SCANHADR4                     1701
#define HADR4                         1702
#define SCANHADR5                     1703
#define HADR5                         1704
#define SCANHADR6                     1705
#define HADR6                         1706
#define SCANHADR7                     1707
#define HADR7                         1708
#define SCANHADRH                     1709
#define HADR8                         1710
#define SCANHADRH_SCANHADR            1711
#define SCANHADR8                     1712
#define SCANHADRH_HADR                1713
#define HADR9                         1714
#define SCANHADR9                     1715
#define HADR10                        1716
#define SCANHADR10                    1717
#define SCANHADR11                    1718
#define HADR11                        1719
#define HADR12                        1720
#define SCANHADR12                    1721
#define HADR13                        1722
#define SCANHADR13                    1723
#define HADR14                        1724
#define SCANHADR14                    1725
#define HADR15                        1726
#define SCANHADR15                    1727
#define SCANCON0                      1728
#define SCANMODE                      1729
#define SCANMODE0                     1730
#define SCANCON0_MODE0                1731
#define SCANCON0_MODE                 1732
#define SCANCON0_MODE1                1733
#define SCANMODE1                     1734
#define INTM                          1735
#define SCANINTM                      1736
#define INVALID                       1737
#define SCANINVALID                   1738
#define SCANCON0_BUSY                 1739
#define SCANBUSY                      1740
#define SCANGO                        1741
#define SCANEN                        1742
#define SCANCON0_EN                   1743
#define SCANTRIG                      1744
#define TSEL0                         1745
#define TSEL                          1746
#define SCANTSEL0                     1747
#define SCANTSEL                      1748
#define TSEL1                         1749
#define SCANTSEL1                     1750
#define TSEL2                         1751
#define SCANTSEL2                     1752
#define TSEL3                         1753
#define SCANTSEL3                     1754
#define CRCDATL                       1755
#define CRCDATL_DAT                   1756
#define CRCDAT0                       1757
#define DAT0                          1758
#define CRCDATL_CRCDAT                1759
#define CRCDAT1                       1760
#define DAT1                          1761
#define CRCDAT2                       1762
#define DAT2                          1763
#define CRCDAT3                       1764
#define DAT3                          1765
#define CRCDAT4                       1766
#define DAT4                          1767
#define CRCDAT5                       1768
#define DAT5                          1769
#define CRCDAT6                       1770
#define DAT6                          1771
#define DAT7                          1772
#define CRDCDAT7                      1773
#define CRCDATH                       1774
#define CRCDAT8                       1775
#define DAT8                          1776
#define CRCDATH_CRCDAT                1777
#define CRCDATH_DAT                   1778
#define CRCDAT9                       1779
#define DAT9                          1780
#define DAT10                         1781
#define CRCDAT10                      1782
#define DAT11                         1783
#define CRCDAT11                      1784
#define DAT12                         1785
#define CRCDAT12                      1786
#define DAT13                         1787
#define CRCDAT13                      1788
#define DAT14                         1789
#define CRCDAT14                      1790
#define DAT15                         1791
#define CRCDAT15                      1792
#define CRCACCL                       1793
#define CRCACCL_CRCACC                1794
#define CRCACC0                       1795
#define CRCACCL_ACC0                  1796
#define CRCACCL_ACC                   1797
#define CRCACC1                       1798
#define CRCACCL_ACC1                  1799
#define CRCACC2                       1800
#define CRCACCL_ACC2                  1801
#define CRCACC3                       1802
#define CRCACCL_ACC3                  1803
#define CRCACC4                       1804
#define CRCACCL_ACC4                  1805
#define CRCACC5                       1806
#define CRCACCL_ACC5                  1807
#define CRCACC6                       1808
#define CRCACCL_ACC6                  1809
#define CRCACC7                       1810
#define CRCACCL_ACC7                  1811
#define CRCACCH                       1812
#define CRCACCH_ACC                   1813
#define CRCACCH_CRCACC                1814
#define CRCACC8                       1815
#define CRCACCH_ACC8                  1816
#define CRCACC9                       1817
#define CRCACCH_ACC9                  1818
#define CRCACCH_ACC10                 1819
#define CRCACC10                      1820
#define CRCACCH_ACC11                 1821
#define CRCACC11                      1822
#define CRCACCH_ACC12                 1823
#define CRCACC12                      1824
#define CRCACCH_ACC13                 1825
#define CRCACC13                      1826
#define CRCACCH_ACC14                 1827
#define CRCACC14                      1828
#define CRCACCH_ACC15                 1829
#define CRCACC15                      1830
#define CRCSHIFTL                     1831
#define CRCSHIFTL_CRCSHIFT            1832
#define CRCSHIFTL_SHIFT               1833
#define SHIFT0                        1834
#define CRCSHIFT0                     1835
#define SHIFT1                        1836
#define CRCSHIFT1                     1837
#define SHIFT2                        1838
#define CRCSHIFT2                     1839
#define SHIFT3                        1840
#define CRCSHIFT3                     1841
#define SHIFT4                        1842
#define CRCSHIFT4                     1843
#define SHIFT5                        1844
#define CRCSHIFT5                     1845
#define SHIFT6                        1846
#define CRCSHIFT6                     1847
#define SHIFT7                        1848
#define CRCSHIFT7                     1849
#define CRCSHIFTH                     1850
#define CRCSHIFT8                     1851
#define CRCSHIFTH_SHIFT               1852
#define CRCSHIFTH_CRCSHIFT            1853
#define SHIFT8                        1854
#define CRCSHIFT9                     1855
#define SHIFT9                        1856
#define SHIFT10                       1857
#define CRCSHIFT10                    1858
#define SHIFT11                       1859
#define CRCSHIFT11                    1860
#define SHIFT12                       1861
#define CRCSHIFT12                    1862
#define SHIFT13                       1863
#define CRCSHIFT13                    1864
#define CRCSHIFT14                    1865
#define SHIFT14                       1866
#define SHIFT15                       1867
#define CRCSHIFT15                    1868
#define CRCXORL                       1869
#define XOR1                          1870
#define CRCXOR1                       1871
#define XOR2                          1872
#define CRCXOR2                       1873
#define XOR3                          1874
#define CRCXOR3                       1875
#define XOR4                          1876
#define CRCXOR4                       1877
#define XOR5                          1878
#define CRCXOR5                       1879
#define XOR6                          1880
#define CRCXOR6                       1881
#define XOR7                          1882
#define CRCXOR7                       1883
#define CRCXORH                       1884
#define XOR8                          1885
#define CRCXOR8                       1886
#define XOR9                          1887
#define CRCXOR9                       1888
#define CRCXOR10                      1889
#define XOR10                         1890
#define CRCXOR11                      1891
#define XOR11                         1892
#define XOR12                         1893
#define CRCXOR12                      1894
#define XOR13                         1895
#define CRCXOR13                      1896
#define CRCXOR14                      1897
#define XOR14                         1898
#define CRCXOR15                      1899
#define XOR15                         1900
#define CRCCON0                       1901
#define CRCFULL                       1902
#define FULL                          1903
#define CRCSHIFTM                     1904
#define SHIFTM                        1905
#define ACCM                          1906
#define CRCACCM                       1907
#define CRCCON0_BUSY                  1908
#define CRCBUSY                       1909
#define CRCGO                         1910
#define CRCCON0_EN                    1911
#define CRCEN                         1912
#define CRCCON1                       1913
#define PLEN0                         1914
#define CRCPLEN0                      1915
#define PLEN                          1916
#define CRCPLEN                       1917
#define PLEN1                         1918
#define CRCPLEN1                      1919
#define PLEN2                         1920
#define CRCPLEN2                      1921
#define PLEN3                         1922
#define CRCPLEN3                      1923
#define DLEN                          1924
#define CRCDLEN                       1925
#define CRCDLEN0                      1926
#define DLEN0                         1927
#define DLEN1                         1928
#define CRCDLEN1                      1929
#define CRCDLEN2                      1930
#define DLEN2                         1931
#define DLEN3                         1932
#define CRCDLEN3                      1933
#define AT1RESL                       1934
#define AT1RES0                       1935
#define RES0                          1936
#define RES1                          1937
#define AT1RES1                       1938
#define AT1RES2                       1939
#define RES2                          1940
#define AT1RES3                       1941
#define RES3                          1942
#define AT1RES4                       1943
#define RES4                          1944
#define AT1RES5                       1945
#define RES5                          1946
#define RES6                          1947
#define AT1RES6                       1948
#define AT1RES7                       1949
#define RES7                          1950
#define AT1RESH                       1951
#define RES8                          1952
#define AT1RES8                       1953
#define RES9                          1954
#define AT1RES9                       1955
#define AT1MISSL                      1956
#define AT1MISS0                      1957
#define MISS0                         1958
#define AT1MISS1                      1959
#define MISS1                         1960
#define AT1MISS2                      1961
#define MISS2                         1962
#define AT1MISS3                      1963
#define MISS3                         1964
#define AT1MISS4                      1965
#define MISS4                         1966
#define AT1MISS5                      1967
#define MISS5                         1968
#define AT1MISS6                      1969
#define MISS6                         1970
#define AT1MISS7                      1971
#define MISS7                         1972
#define AT1MISSH                      1973
#define MISS8                         1974
#define AT1MISS8                      1975
#define MISS9                         1976
#define AT1MISS9                      1977
#define MISS10                        1978
#define AT1MISS10                     1979
#define MISS11                        1980
#define AT1MISS11                     1981
#define AT1MISS12                     1982
#define MISS12                        1983
#define AT1MISS13                     1984
#define MISS13                        1985
#define AT1MISS14                     1986
#define MISS14                        1987
#define AT1MISS15                     1988
#define MISS15                        1989
#define AT1PERL                       1990
#define PER0                          1991
#define AT1PER0                       1992
#define PERL0                         1993
#define PER1                          1994
#define AT1PER1                       1995
#define PERL1                         1996
#define PER2                          1997
#define AT1PER2                       1998
#define PERL2                         1999
#define PER3                          2000
#define AT1PER3                       2001
#define PERL3                         2002
#define PER4                          2003
#define AT1PER4                       2004
#define PERL4                         2005
#define PER5                          2006
#define AT1PER5                       2007
#define PERL5                         2008
#define PER6                          2009
#define AT1PER6                       2010
#define PERL6                         2011
#define PER7                          2012
#define AT1PER7                       2013
#define PERL7                         2014
#define AT1PERH                       2015
#define PER8                          2016
#define AT1PER8                       2017
#define PERH0                         2018
#define PER9                          2019
#define AT1PER9                       2020
#define PERH1                         2021
#define AT1PER10                      2022
#define PER10                         2023
#define PERH2                         2024
#define AT1PER11                      2025
#define PER11                         2026
#define PERH3                         2027
#define AT1PER12                      2028
#define PER12                         2029
#define PERH4                         2030
#define AT1PER13                      2031
#define PER13                         2032
#define PERH5                         2033
#define AT1PER14                      2034
#define PER14                         2035
#define PERH6                         2036
#define PER15                         2037
#define AT1POV                        2038
#define PERH7                         2039
#define AT1PHSL                       2040
#define PHS0                          2041
#define AT1PHS0                       2042
#define PHS1                          2043
#define AT1PHS1                       2044
#define PHS2                          2045
#define AT1PHS2                       2046
#define PHS3                          2047
#define AT1PHS3                       2048
#define PHS4                          2049
#define AT1PHS4                       2050
#define PHS5                          2051
#define AT1PHS5                       2052
#define PHS6                          2053
#define AT1PHS6                       2054
#define PHS7                          2055
#define AT1PHS7                       2056
#define AT1PHSH                       2057
#define PHSL8                         2058
#define PHS8                          2059
#define AT1PHS8                       2060
#define PHSL9                         2061
#define PHS9                          2062
#define AT1PHS9                       2063
#define AT1CON0                       2064
#define AT1CON0_MODE                  2065
#define AT1MODE                       2066
#define APMOD                         2067
#define AT1APMOD                      2068
#define AT1CON0_POL                   2069
#define AT1POL                        2070
#define AT1PS0                        2071
#define AT1CON0_PS                    2072
#define AT1PS                         2073
#define AT1CON0_PS0                   2074
#define AT1PS1                        2075
#define AT1CON0_PS1                   2076
#define PREC                          2077
#define AT1PREC                       2078
#define AT1CON0_EN                    2079
#define AT1EN                         2080
#define AT1CON1                       2081
#define AT1VALID                      2082
#define VALID                         2083
#define AT1ACCS                       2084
#define ACCS                          2085
#define MPP                           2086
#define AT1MPP                        2087
#define AT1PRP                        2088
#define PRP                           2089
#define AT1PHP                        2090
#define PHP                           2091
#define AT1IR0                        2092
#define AT1PERIF                      2093
#define AT1MISSIF                     2094
#define AT1PHSIF                      2095
#define AT1IE0                        2096
#define AT1PERIE                      2097
#define AT1MISSIE                     2098
#define AT1PHSIE                      2099
#define AT1IR1                        2100
#define AT1CC1IF                      2101
#define AT1CC2IF                      2102
#define AT1CC3IF                      2103
#define AT1IE1                        2104
#define AT1CC1IE                      2105
#define AT1CC2IE                      2106
#define AT1CC3IE                      2107
#define AT1STPTL                      2108
#define STPT0                         2109
#define AT1STPT0                      2110
#define STPT1                         2111
#define AT1STPT1                      2112
#define STPT2                         2113
#define AT1STPT2                      2114
#define STPT3                         2115
#define AT1STPT3                      2116
#define STPT4                         2117
#define AT1STPT4                      2118
#define STPT5                         2119
#define AT1STPT5                      2120
#define STPT6                         2121
#define AT1STPT6                      2122
#define STPT7                         2123
#define AT1STPT7                      2124
#define AT1STPTH                      2125
#define STPT8                         2126
#define AT1STPT8                      2127
#define STPT9                         2128
#define AT1STPT9                      2129
#define AT1STPT10                     2130
#define STPT10                        2131
#define AT1STPT11                     2132
#define STPT11                        2133
#define AT1STPT12                     2134
#define STPT12                        2135
#define AT1STPT13                     2136
#define STPT13                        2137
#define AT1STPT14                     2138
#define STPT14                        2139
#define AT1ERRL                       2140
#define AT1ERR0                       2141
#define ERR0                          2142
#define ERRL0                         2143
#define AT1ERR1                       2144
#define ERR1                          2145
#define ERRL1                         2146
#define AT1ERR2                       2147
#define ERR2                          2148
#define ERRL2                         2149
#define AT1ERR3                       2150
#define ERR3                          2151
#define ERRL3                         2152
#define AT1ERR4                       2153
#define ERRL4                         2154
#define ERR4                          2155
#define AT1ERR5                       2156
#define ERRL5                         2157
#define ERR5                          2158
#define AT1ERR6                       2159
#define ERRL6                         2160
#define ERR6                          2161
#define AT1ERR7                       2162
#define ERRL7                         2163
#define ERR7                          2164
#define AT1ERRH                       2165
#define AT1ERR8                       2166
#define ERRH0                         2167
#define ERR8                          2168
#define AT1ERR9                       2169
#define ERRH1                         2170
#define ERR9                          2171
#define AT1ERR10                      2172
#define ERR10                         2173
#define ERRH2                         2174
#define AT1ERR11                      2175
#define ERR11                         2176
#define ERRH3                         2177
#define AT1ERR12                      2178
#define ERR12                         2179
#define ERRH4                         2180
#define AT1ERR13                      2181
#define ERR13                         2182
#define ERRH5                         2183
#define AT1ERR14                      2184
#define ERR14                         2185
#define ERRH6                         2186
#define AT1ERR15                      2187
#define ERR15                         2188
#define ERRH7                         2189
#define AT1CLK                        2190
#define AT1CLK_CS                     2191
#define AT1CS                         2192
#define AT1CLK_CS0                    2193
#define AT1CS0                        2194
#define AT1SIG                        2195
#define AT1SSEL0                      2196
#define AT1SIG_SSEL0                  2197
#define AT1SIG_SSEL                   2198
#define AT1SSEL                       2199
#define AT1SSEL1                      2200
#define AT1SIG_SSEL1                  2201
#define AT1SSEL2                      2202
#define AT1SIG_SSEL2                  2203
#define AT1CSEL1                      2204
#define CP1S0                         2205
#define AT1CP1S0                      2206
