tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1619_tdd.h
#define T3CKIPPS2                     2765
#define T3CKIPPS3                     2766
#define T3CKIPPS4                     2767
#define T3GPPS                        2768
#define T3GPPS0                       2769
#define T3GPPS1                       2770
#define T3GPPS2                       2771
#define T3GPPS3                       2772
#define T3GPPS4                       2773
#define T4PPS                         2774
#define T4PPS0                        2775
#define T4PPS1                        2776
#define T4PPS2                        2777
#define T4PPS3                        2778
#define T4PPS4                        2779
#define T5CKIPPS                      2780
#define T5CKIPPS0                     2781
#define T5CKIPPS1                     2782
#define T5CKIPPS2                     2783
#define T5CKIPPS3                     2784
#define T5CKIPPS4                     2785
#define T5GPPS                        2786
#define T5GPPS0                       2787
#define T5GPPS1                       2788
#define T5GPPS2                       2789
#define T5GPPS3                       2790
#define T5GPPS4                       2791
#define T6PPS                         2792
#define T6PPS0                        2793
#define T6PPS1                        2794
#define T6PPS2                        2795
#define T6PPS3                        2796
#define T6PPS4                        2797
#define ATCC1PPS                      2798
#define ATCC1PPS0                     2799
#define ATCC1PPS1                     2800
#define ATCC1PPS2                     2801
#define ATCC1PPS3                     2802
#define ATCC1PPS4                     2803
#define SSPCLKPPS                     2804
#define SSPCLKPPS0                    2805
#define SSPCLKPPS1                    2806
#define SSPCLKPPS2                    2807
#define SSPCLKPPS3                    2808
#define SSPCLKPPS4                    2809
#define SSPDATPPS                     2810
#define SSPDATPPS0                    2811
#define SSPDATPPS1                    2812
#define SSPDATPPS2                    2813
#define SSPDATPPS3                    2814
#define SSPDATPPS4                    2815
#define SSPSSPPS                      2816
#define SSPSSPPS0                     2817
#define SSPSSPPS1                     2818
#define SSPSSPPS2                     2819
#define SSPSSPPS3                     2820
#define SSPSSPPS4                     2821
#define ATCC2PPS                      2822
#define ATCC2PPS0                     2823
#define ATCC2PPS1                     2824
#define ATCC2PPS2                     2825
#define ATCC2PPS3                     2826
#define ATCC2PPS4                     2827
#define RXPPS                         2828
#define RXPPS0                        2829
#define RXPPS1                        2830
#define RXPPS2                        2831
#define RXPPS3                        2832
#define RXPPS4                        2833
#define CKPPS                         2834
#define CKPPS0                        2835
#define CKPPS1                        2836
#define CKPPS2                        2837
#define CKPPS3                        2838
#define CKPPS4                        2839
#define SMT1SIGPPS                    2840
#define SMT1SIGPPS0                   2841
#define SMT1SIGPPS1                   2842
#define SMT1SIGPPS2                   2843
#define SMT1SIGPPS3                   2844
#define SMT1SIGPPS4                   2845
#define SMT1WINPPS                    2846
#define SMTWINPPS0                    2847
#define SMTWINPPS1                    2848
#define SMTWINPPS2                    2849
#define SMTWINPPS3                    2850
#define SMTWINPPS4                    2851
#define CLCIN0PPS                     2852
#define CLCIN0PPS0                    2853
#define CLCIN0PPS1                    2854
#define CLCIN0PPS2                    2855
#define CLCIN0PPS3                    2856
#define CLCIN0PPS4                    2857
#define CLCIN1PPS                     2858
#define CLCIN1PPS0                    2859
#define CLCIN1PPS1                    2860
#define CLCIN1PPS2                    2861
#define CLCIN1PPS3                    2862
#define CLCIN1PPS4                    2863
#define CLCIN2PPS                     2864
#define CLCIN2PPS0                    2865
#define CLCIN2PPS1                    2866
#define CLCIN2PPS2                    2867
#define CLCIN2PPS3                    2868
#define CLCIN2PPS4                    2869
#define CLCIN3PPS                     2870
#define CLCIN3PPS0                    2871
#define CLCIN3PPS1                    2872
#define CLCIN3PPS2                    2873
#define CLCIN3PPS3                    2874
#define CLCIN3PPS4                    2875
#define SMT2SIGPPS                    2876
#define SMT2SIGPPS0                   2877
#define SMT2SIGPPS1                   2878
#define SMT2SIGPPS2                   2879
#define SMT2SIGPPS3                   2880
#define SMT2SIGPPS4                   2881
#define SMT2WINPPS                    2882
#define SMT2WINPPS0                   2883
#define SMT2WINPPS1                   2884
#define SMT2WINPPS2                   2885
#define SMT2WINPPS3                   2886
#define SMT2WINPPS4                   2887
#define ATCC3PPS                      2888
#define ATCC3PPS0                     2889
#define ATCC3PPS1                     2890
#define ATCC3PPS2                     2891
#define ATCC3PPS3                     2892
#define ATCC3PPS4                     2893
#define RA0PPS                        2894
#define RA0PPS0                       2895
#define RA0PPS1                       2896
#define RA0PPS2                       2897
#define RA0PPS3                       2898
#define RA0PPS4                       2899
#define RA1PPS                        2900
#define RA1PPS0                       2901
#define RA1PPS1                       2902
#define RA1PPS2                       2903
#define RA1PPS3                       2904
#define RA1PPS4                       2905
#define RA2PPS                        2906
#define RA2PPS0                       2907
#define RA2PPS1                       2908
#define RA2PPS2                       2909
#define RA2PPS3                       2910
#define RA2PPS4                       2911
#define RA4PPS                        2912
#define RA4PPS0                       2913
#define RA4PPS1                       2914
#define RA4PPS2                       2915
#define RA4PPS3                       2916
#define RA4PPS4                       2917
#define RA5PPS                        2918
#define RA5PPS0                       2919
#define RA5PPS1                       2920
#define RA5PPS2                       2921
#define RA5PPS3                       2922
#define RA5PPS4                       2923
#define RB4PPS                        2924
#define RB4PPS0                       2925
#define RB4PPS1                       2926
#define RB4PPS2                       2927
#define RB4PPS3                       2928
#define RB4PPS4                       2929
#define RB5PPS                        2930
#define RB5PPS0                       2931
#define RB5PPS1                       2932
#define RB5PPS2                       2933
#define RB5PPS3                       2934
#define RB5PPS4                       2935
#define RB6PPS                        2936
#define RB6PPS0                       2937
#define RB6PPS1                       2938
#define RB6PPS2                       2939
#define RB6PPS3                       2940
#define RB6PPS4                       2941
#define RB7PPS                        2942
#define RB7PPS0                       2943
#define RB7PPS1                       2944
#define RB7PPS2                       2945
#define RB7PPS3                       2946
#define RB7PPS4                       2947
#define RC0PPS                        2948
#define RC0PPS0                       2949
#define RC0PPS1                       2950
#define RC0PPS2                       2951
#define RC0PPS3                       2952
#define RC0PPS4                       2953
#define RC1PPS                        2954
#define RC1PPS0                       2955
#define RC1PPS1                       2956
#define RC1PPS2                       2957
#define RC1PPS3                       2958
#define RC1PPS4                       2959
#define RC2PPS                        2960
#define RC2PPS0                       2961
#define RC2PPS1                       2962
#define RC2PPS2                       2963
#define RC2PPS3                       2964
#define RC2PPS4                       2965
#define RC3PPS                        2966
#define RC3PPS0                       2967
#define RC3PPS1                       2968
#define RC3PPS2                       2969
#define RC3PPS3                       2970
#define RC3PPS4                       2971
#define RC4PPS                        2972
#define RC4PPS0                       2973
#define RC4PPS1                       2974
#define RC4PPS2                       2975
#define RC4PPS3                       2976
#define RC4PPS4                       2977
#define RC5PPS                        2978
#define RC5PPS0                       2979
#define RC5PPS1                       2980
#define RC5PPS2                       2981
#define RC5PPS3                       2982
#define RC5PPS4                       2983
#define RC6PPS                        2984
#define RC6PPS0                       2985
#define RC6PPS1                       2986
#define RC6PPS2                       2987
#define RC6PPS3                       2988
#define RC6PPS4                       2989
#define RC7PPS                        2990
#define RC7PPS0                       2991
#define RC7PPS1                       2992
#define RC7PPS2                       2993
#define RC7PPS3                       2994
#define RC7PPS4                       2995
#define CLCDATA                       2996
#define MLC1OUT                       2997
#define MLC2OUT                       2998
#define MLC3OUT                       2999
#define MLC4OUT                       3000
#define CLC1CON                       3001
#define CLC1CON_MODE                  3002
#define LC1MODE0                      3003
#define LC1MODE                       3004
#define CLC1CON_MODE0                 3005
#define LC1MODE1                      3006
#define CLC1CON_MODE1                 3007
#define LC1MODE2                      3008
#define CLC1CON_MODE2                 3009
#define LC1INTN                       3010
#define CLC1CON_INTN                  3011
#define LC1INTP                       3012
#define CLC1CON_INTP                  3013
#define LC1OUT                        3014
#define CLC1CON_OUT                   3015
#define LC1EN                         3016
#define CLC1CON_EN                    3017
#define CLC1POL                       3018
#define LC1G1POL                      3019
#define CLC1POL_G1POL                 3020
#define CLC1POL_G2POL                 3021
#define LC1G2POL                      3022
#define LC1G3POL                      3023
#define CLC1POL_G3POL                 3024
#define LC1G4POL                      3025
#define CLC1POL_G4POL                 3026
#define CLC1POL_POL                   3027
#define LC1POL                        3028
#define CLC1SEL0                      3029
#define CLC1SEL0_D1S0                 3030
#define LC1D1S0                       3031
#define CLC1SEL0_D1S                  3032
#define LC1D1S                        3033
#define CLC1SEL0_D1S1                 3034
#define LC1D1S1                       3035
#define CLC1SEL0_D1S2                 3036
#define LC1D1S2                       3037
#define LC1D1S3                       3038
#define CLC1SEL0_D1S3                 3039
#define CLC1SEL0_D1S4                 3040
#define LC1D1S4                       3041
#define CLC1SEL0_D1S5                 3042
#define LC1D1S5                       3043
#define CLC1SEL1                      3044
#define CLC1SEL1_D2S0                 3045
#define CLC1SEL1_D2S                  3046
#define LC1D2S                        3047
#define LC1D2S0                       3048
#define CLC1SEL1_D2S1                 3049
#define LC1D2S1                       3050
#define CLC1SEL1_D2S2                 3051
#define LC1D2S2                       3052
#define LC1D2S3                       3053
#define CLC1SEL1_D2S3                 3054
#define LC1D2S4                       3055
#define CLC1SEL1_D2S4                 3056
#define LC1D2S5                       3057
#define CLC1SEL1_D2S5                 3058
#define CLC1SEL2                      3059
#define LC1D3S0                       3060
#define CLC1SEL2_D3S                  3061
#define LC1D3S                        3062
#define CLC1SEL2_D3S0                 3063
#define LC1D3S1                       3064
#define CLC1SEL2_D3S1                 3065
#define LC1D3S2                       3066
#define CLC1SEL2_D3S2                 3067
#define LC1D3S3                       3068
#define CLC1SEL2_D3S3                 3069
#define LC1D3S4                       3070
#define CLC1SEL2_D3S4                 3071
#define LC1D3S5                       3072
#define CLC1SEL2_D3S5                 3073
#define CLC1SEL3                      3074
#define CLC1SEL3_D4S                  3075
#define LC1D4S                        3076
#define LC1D4S0                       3077
#define CLC1SEL3_D4S0                 3078
#define CLC1SEL3_D4S1                 3079
#define LC1D4S1                       3080
#define LC1D4S2                       3081
#define CLC1SEL3_D4S2                 3082
#define LC1D4S3                       3083
#define CLC1SEL3_D4S3                 3084
#define LC1D4S4                       3085
#define CLC1SEL3_D4S4                 3086
#define LC1D4S5                       3087
#define CLC1SEL3_D4S5                 3088
#define CLC1GLS0                      3089
#define CLC1GLS0_D1N                  3090
#define LC1G1D1N                      3091
#define CLC1GLS0_D1T                  3092
#define LC1G1D1T                      3093
#define LC1G1D2N                      3094
#define CLC1GLS0_D2N                  3095
#define LC1G1D2T                      3096
#define CLC1GLS0_D2T                  3097
#define CLC1GLS0_D3N                  3098
#define LC1G1D3N                      3099
#define CLC1GLS0_D3T                  3100
#define LC1G1D3T                      3101
#define CLC1GLS0_D4N                  3102
#define LC1G1D4N                      3103
#define CLC1GLS0_D4T                  3104
#define LC1G1D4T                      3105
#define CLC1GLS1                      3106
#define CLC1GLS1_D1N                  3107
#define LC1G2D1N                      3108
#define LC1G2D1T                      3109
#define CLC1GLS1_D1T                  3110
#define CLC1GLS1_D2N                  3111
#define LC1G2D2N                      3112
#define LC1G2D2T                      3113
#define CLC1GLS1_D2T                  3114
#define CLC1GLS1_D3N                  3115
#define LC1G2D3N                      3116
#define LC1G2D3T                      3117
#define CLC1GLS1_D3T                  3118
#define CLC1GLS1_D4N                  3119
#define LC1G2D4N                      3120
#define LC1G2D4T                      3121
#define CLC1GLS1_D4T                  3122
#define CLC1GLS2                      3123
#define CLC1GLS2_D1N                  3124
#define LC1G3D1N                      3125
#define LC1G3D1T                      3126
#define CLC1GLS2_D1T                  3127
#define LC1G3D2N                      3128
#define CLC1GLS2_D2N                  3129
#define LC1G3D2T                      3130
#define CLC1GLS2_D2T                  3131
#define CLC1GLS2_D3N                  3132
#define LC1G3D3N                      3133
#define LC1G3D3T                      3134
#define CLC1GLS2_D3T                  3135
#define LC1G3D4N                      3136
#define CLC1GLS2_D4N                  3137
#define LC1G3D4T                      3138
#define CLC1GLS2_D4T                  3139
#define CLC1GLS3                      3140
#define LC1G4D1N                      3141
#define CLC1GLS3_G4D1N                3142
#define LC1G4D1T                      3143
#define CLC1GLS3_G4D1T                3144
#define CLC1GLS3_G4D2N                3145
#define LC1G4D2N                      3146
#define CLC1GLS3_G4D2T                3147
#define LC1G4D2T                      3148
#define LC1G4D3N                      3149
#define CLC1GLS3_G4D3N                3150
#define LC1G4D3T                      3151
#define CLC1GLS3_G4D3T                3152
#define CLC1GLS3_G4D4N                3153
#define LC1G4D4N                      3154
#define CLC1GLS3_G4D4T                3155
#define LC1G4D4T                      3156
#define CLC2CON                       3157
#define LC2MODE0                      3158
#define CLC2CON_MODE                  3159
#define LC2MODE                       3160
#define CLC2CON_MODE0                 3161
#define LC2MODE1                      3162
#define CLC2CON_MODE1                 3163
#define LC2MODE2                      3164
#define CLC2CON_MODE2                 3165
#define LC2INTN                       3166
#define CLC2CON_INTN                  3167
#define LC2INTP                       3168
#define CLC2CON_INTP                  3169
#define CLC2CON_OUT                   3170
#define LC2OUT                        3171
#define CLC2CON_EN                    3172
#define LC2EN                         3173
#define CLC2POL                       3174
#define LC2G1POL                      3175
#define CLC2POL_G1POL                 3176
#define LC2G2POL                      3177
#define CLC2POL_G2POL                 3178
#define LC2G3POL                      3179
#define CLC2POL_G3POL                 3180
#define LC2G4POL                      3181
#define CLC2POL_G4POL                 3182
#define CLC2POL_POL                   3183
#define LC2POL                        3184
#define CLC2SEL0                      3185
#define CLC2SEL0_D1S                  3186
#define LC2D1S0                       3187
#define CLC2SEL0_D1S0                 3188
#define LC2D1S                        3189
#define LC2D1S1                       3190
#define CLC2SEL0_D1S1                 3191
#define LC2D1S2                       3192
#define CLC2SEL0_D1S2                 3193
#define CLC2SEL0_D1S3                 3194
#define LC2D1S3                       3195
#define LC2D1S4                       3196
#define CLC2SEL0_D1S4                 3197
#define LC2D1S5                       3198
#define CLC2SEL0_D1S5                 3199
#define CLC2SEL1                      3200
#define LC2D2S0                       3201
#define CLC2SEL1_D2S0                 3202
#define LC2D2S                        3203
#define CLC2SEL1_D2S                  3204
#define LC2D2S1                       3205
#define CLC2SEL1_D2S1                 3206
#define LC2D2S2                       3207
#define CLC2SEL1_D2S2                 3208
#define LC2D2S3                       3209
#define CLC2SEL1_D2S3                 3210
#define LC2D2S4                       3211
#define CLC2SEL1_D2S4                 3212
#define LC2D2S5                       3213
#define CLC2SEL1_D2S5                 3214
#define CLC2SEL2                      3215
#define CLC2SEL2_D3S                  3216
#define LC2D3S0                       3217
#define CLC2SEL2_D3S0                 3218
#define LC2D3S                        3219
#define CLC2SEL2_D3S1                 3220
#define LC2D3S1                       3221
#define LC2D3S2                       3222
#define CLC2SEL2_D3S2                 3223
#define LC2D3S3                       3224
#define CLC2SEL2_D3S3                 3225
#define LC2D3S4                       3226
#define CLC2SEL2_D3S4                 3227
#define LC2D3S5                       3228
#define CLC2SEL2_D3S5                 3229
#define CLC2SEL3                      3230
#define LC2D4S0                       3231
#define CLC2SEL3_D4S                  3232
#define CLC2SEL3_D4S0                 3233
#define LC2D4S                        3234
#define LC2D4S1                       3235
#define CLC2SEL3_D4S1                 3236
#define LC2D4S2                       3237
#define CLC2SEL3_D4S2                 3238
#define CLC2SEL3_D4S3                 3239
#define LC2D4S3                       3240
#define LC2D4S4                       3241
#define CLC2SEL3_D4S4                 3242
#define LC2D4S5                       3243
#define CLC2SEL3_D4S5                 3244
#define CLC2GLS0                      3245
#define LC2G1D1N                      3246
#define CLC2GLS0_D1N                  3247
#define CLC2GLS0_D1T                  3248
#define LC2G1D1T                      3249
#define LC2G1D2N                      3250
#define CLC2GLS0_D2N                  3251
#define CLC2GLS0_D2T                  3252
#define LC2G1D2T                      3253
#define LC2G1D3N                      3254
#define CLC2GLS0_D3N                  3255
#define CLC2GLS0_D3T                  3256
#define LC2G1D3T                      3257
#define LC2G1D4N                      3258
#define CLC2GLS0_D4N                  3259
#define CLC2GLS0_D4T                  3260
#define LC2G1D4T                      3261
#define CLC2GLS1                      3262
#define CLC2GLS1_D1N                  3263
#define LC2G2D1N                      3264
#define CLC2GLS1_D1T                  3265
#define LC2G2D1T                      3266
#define CLC2GLS1_D2N                  3267
#define LC2G2D2N                      3268
#define CLC2GLS1_D2T                  3269
#define LC2G2D2T                      3270
#define LC2G2D3N                      3271
#define CLC2GLS1_D3N                  3272
#define LC2G2D3T                      3273
#define CLC2GLS1_D3T                  3274
#define LC2G2D4N                      3275
#define CLC2GLS1_D4N                  3276
#define LC2G2D4T                      3277
#define CLC2GLS1_D4T                  3278
#define CLC2GLS2                      3279
#define LC2G3D1N                      3280
#define CLC2GLS2_D1N                  3281
#define CLC2GLS2_D1T                  3282
#define LC2G3D1T                      3283
#define CLC2GLS2_D2N                  3284
#define LC2G3D2N                      3285
#define LC2G3D2T                      3286
#define CLC2GLS2_D2T                  3287
#define CLC2GLS2_D3N                  3288
#define LC2G3D3N                      3289
#define CLC2GLS2_D3T                  3290
#define LC2G3D3T                      3291
#define CLC2GLS2_D4N                  3292
#define LC2G3D4N                      3293
#define LC2G3D4T                      3294
#define CLC2GLS2_D4T                  3295
#define CLC2GLS3                      3296
#define LC2G4D1N                      3297
#define CLC2GLS3_G4D1N                3298
#define CLC2GLS3_G4D1T                3299
#define LC2G4D1T                      3300
#define CLC2GLS3_G4D2N                3301
#define LC2G4D2N                      3302
#define LC2G4D2T                      3303
#define CLC2GLS3_G4D2T                3304
#define CLC2GLS3_G4D3N                3305
#define LC2G4D3N                      3306
#define CLC2GLS3_G4D3T                3307
#define LC2G4D3T                      3308
#define LC2G4D4N                      3309
#define CLC2GLS3_G4D4N                3310
#define CLC2GLS3_G4D4T                3311
#define LC2G4D4T                      3312
#define CLC3CON                       3313
#define LC3MODE0                      3314
#define CLC3CON_MODE0                 3315
#define CLC3CON_MODE                  3316
#define LC3MODE                       3317
#define LC3MODE1                      3318
#define CLC3CON_MODE1                 3319
#define LC3MODE2                      3320
#define CLC3CON_MODE2                 3321
#define LC3INTN                       3322
