tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1619_tdd.h
#define CLC3CON_INTN                  3323
#define CLC3CON_INTP                  3324
#define LC3INTP                       3325
#define CLC3CON_OUT                   3326
#define LC3OUT                        3327
#define LC3EN                         3328
#define CLC3CON_EN                    3329
#define CLC3POL                       3330
#define LC3G1POL                      3331
#define CLC3POL_G1POL                 3332
#define LC3G2POL                      3333
#define CLC3POL_G2POL                 3334
#define CLC3POL_G3POL                 3335
#define LC3G3POL                      3336
#define LC3G4POL                      3337
#define CLC3POL_G4POL                 3338
#define LC3POL                        3339
#define CLC3POL_POL                   3340
#define CLC3SEL0                      3341
#define CLC3SEL0_D1S0                 3342
#define LC3D1S0                       3343
#define CLC3SEL0_D1S                  3344
#define LC3D1S                        3345
#define LC3D1S1                       3346
#define CLC3SEL0_D1S1                 3347
#define LC3D1S2                       3348
#define CLC3SEL0_D1S2                 3349
#define LC3D1S3                       3350
#define CLC3SEL0_D1S3                 3351
#define LC3D1S4                       3352
#define CLC3SEL0_D1S4                 3353
#define LC3D1S5                       3354
#define CLC3SEL0_D1S5                 3355
#define CLC3SEL1                      3356
#define CLC3SEL1_D2S                  3357
#define CLC3SEL1_D2S0                 3358
#define LC3D2S                        3359
#define LC3D2S0                       3360
#define CLC3SEL1_D2S1                 3361
#define LC3D2S1                       3362
#define CLC3SEL1_D2S2                 3363
#define LC3D2S2                       3364
#define CLC3SEL1_D2S3                 3365
#define LC3D2S3                       3366
#define CLC3SEL1_D2S4                 3367
#define LC3D2S4                       3368
#define CLC3SEL1_D2S5                 3369
#define LC3D2S5                       3370
#define CLC3SEL2                      3371
#define LC3D3S                        3372
#define CLC3SEL2_D3S                  3373
#define LC3D3S0                       3374
#define CLC3SEL2_D3S0                 3375
#define LC3D3S1                       3376
#define CLC3SEL2_D3S1                 3377
#define LC3D3S2                       3378
#define CLC3SEL2_D3S2                 3379
#define LC3D3S3                       3380
#define CLC3SEL2_D3S3                 3381
#define CLC3SEL2_D3S4                 3382
#define LC3D3S4                       3383
#define CLC3SEL2_D3S5                 3384
#define LC3D3S5                       3385
#define CLC3SEL3                      3386
#define CLC3SEL3_D4S0                 3387
#define LC3D4S0                       3388
#define CLC3SEL3_D4S                  3389
#define LC3D4S                        3390
#define LC3D4S1                       3391
#define CLC3SEL3_D4S1                 3392
#define LC3D4S2                       3393
#define CLC3SEL3_D4S2                 3394
#define LC3D4S3                       3395
#define CLC3SEL3_D4S3                 3396
#define LC3D4S4                       3397
#define CLC3SEL3_D4S4                 3398
#define LC3D4S5                       3399
#define CLC3SEL3_D4S5                 3400
#define CLC3GLS0                      3401
#define CLC3GLS0_D1N                  3402
#define LC3G1D1N                      3403
#define LC3G1D1T                      3404
#define CLC3GLS0_D1T                  3405
#define LC3G1D2N                      3406
#define CLC3GLS0_D2N                  3407
#define CLC3GLS0_D2T                  3408
#define LC3G1D2T                      3409
#define CLC3GLS0_D3N                  3410
#define LC3G1D3N                      3411
#define LC3G1D3T                      3412
#define CLC3GLS0_D3T                  3413
#define CLC3GLS0_D4N                  3414
#define LC3G1D4N                      3415
#define CLC3GLS0_D4T                  3416
#define LC3G1D4T                      3417
#define CLC3GLS1                      3418
#define LC3G2D1N                      3419
#define CLC3GLS1_D1N                  3420
#define CLC3GLS1_D1T                  3421
#define LC3G2D1T                      3422
#define LC3G2D2N                      3423
#define CLC3GLS1_D2N                  3424
#define LC3G2D2T                      3425
#define CLC3GLS1_D2T                  3426
#define LC3G2D3N                      3427
#define CLC3GLS1_D3N                  3428
#define CLC3GLS1_D3T                  3429
#define LC3G2D3T                      3430
#define LC3G2D4N                      3431
#define CLC3GLS1_D4N                  3432
#define LC3G2D4T                      3433
#define CLC3GLS1_D4T                  3434
#define CLC3GLS2                      3435
#define LC3G3D1N                      3436
#define CLC3GLS2_D1N                  3437
#define LC3G3D1T                      3438
#define CLC3GLS2_D1T                  3439
#define CLC3GLS2_D2N                  3440
#define LC3G3D2N                      3441
#define CLC3GLS2_D2T                  3442
#define LC3G3D2T                      3443
#define CLC3GLS2_D3N                  3444
#define LC3G3D3N                      3445
#define LC3G3D3T                      3446
#define CLC3GLS2_D3T                  3447
#define CLC3GLS2_D4N                  3448
#define LC3G3D4N                      3449
#define CLC3GLS2_D4T                  3450
#define LC3G3D4T                      3451
#define CLC3GLS3                      3452
#define LC3G4D1N                      3453
#define CLC3GLS3_G4D1N                3454
#define LC3G4D1T                      3455
#define CLC3GLS3_G4D1T                3456
#define LC3G4D2N                      3457
#define CLC3GLS3_G4D2N                3458
#define CLC3GLS3_G4D2T                3459
#define LC3G4D2T                      3460
#define LC3G4D3N                      3461
#define CLC3GLS3_G4D3N                3462
#define CLC3GLS3_G4D3T                3463
#define LC3G4D3T                      3464
#define LC3G4D4N                      3465
#define CLC3GLS3_G4D4N                3466
#define LC3G4D4T                      3467
#define CLC3GLS3_G4D4T                3468
#define CLC4CON                       3469
#define LC4MODE                       3470
#define CLC4CON_MODE                  3471
#define LC4MODE0                      3472
#define CLC4CON_MODE0                 3473
#define LC4MODE1                      3474
#define CLC4CON_MODE1                 3475
#define LC4MODE2                      3476
#define CLC4CON_MODE2                 3477
#define LC4INTN                       3478
#define CLC4CON_INTN                  3479
#define CLC4CON_INTP                  3480
#define LC4INTP                       3481
#define CLC4CON_OUT                   3482
#define LC4OUT                        3483
#define CLC4CON_EN                    3484
#define LC4EN                         3485
#define CLC4POL                       3486
#define CLC4POL_G1POL                 3487
#define LC4G1POL                      3488
#define CLC4POL_G2POL                 3489
#define LC4G2POL                      3490
#define CLC4POL_G3POL                 3491
#define LC4G3POL                      3492
#define LC4G4POL                      3493
#define CLC4POL_G4POL                 3494
#define LC4POL                        3495
#define CLC4POL_POL                   3496
#define CLC4SEL0                      3497
#define CLC4SEL0_D1S0                 3498
#define LC4D1S0                       3499
#define CLC4SEL0_D1S                  3500
#define LC4D1S                        3501
#define CLC4SEL0_D1S1                 3502
#define LC4D1S1                       3503
#define CLC4SEL0_D1S2                 3504
#define LC4D1S2                       3505
#define CLC4SEL0_D1S3                 3506
#define LC4D1S3                       3507
#define CLC4SEL0_D1S4                 3508
#define LC4D1S4                       3509
#define CLC4SEL0_D1S5                 3510
#define LC4D1S5                       3511
#define CLC4SEL1                      3512
#define LC4D2S0                       3513
#define CLC4SEL1_D2S                  3514
#define CLC4SEL1_D2S0                 3515
#define LC4D2S                        3516
#define CLC4SEL1_D2S1                 3517
#define LC4D2S1                       3518
#define LC4D2S2                       3519
#define CLC4SEL1_D2S2                 3520
#define LC4D2S3                       3521
#define CLC4SEL1_D2S3                 3522
#define LC4D2S4                       3523
#define CLC4SEL1_D2S4                 3524
#define LC4D2S5                       3525
#define CLC4SEL1_D2S5                 3526
#define CLC4SEL2                      3527
#define LC4D3S                        3528
#define CLC4SEL2_D3S                  3529
#define CLC4SEL2_D3S0                 3530
#define LC4D3S0                       3531
#define LC4D3S1                       3532
#define CLC4SEL2_D3S1                 3533
#define CLC4SEL2_D3S2                 3534
#define LC4D3S2                       3535
#define CLC4SEL2_D3S3                 3536
#define LC4D3S3                       3537
#define CLC4SEL2_D3S4                 3538
#define LC4D3S4                       3539
#define CLC4SEL2_D3S5                 3540
#define LC4D3S5                       3541
#define CLC4SEL3                      3542
#define LC4D4S0                       3543
#define LC4D4S                        3544
#define CLC4SEL3_D4S0                 3545
#define CLC4SEL3_D4S                  3546
#define LC4D4S1                       3547
#define CLC4SEL3_D4S1                 3548
#define LC4D4S2                       3549
#define CLC4SEL3_D4S2                 3550
#define LC4D4S3                       3551
#define CLC4SEL3_D4S3                 3552
#define LC4D4S4                       3553
#define CLC4SEL3_D4S4                 3554
#define LC4D4S5                       3555
#define CLC4SEL3_D4S5                 3556
#define CLC4GLS0                      3557
#define CLC4GLS0_D1N                  3558
#define LC4G1D1N                      3559
#define CLC4GLS0_D1T                  3560
#define LC4G1D1T                      3561
#define CLC4GLS0_D2N                  3562
#define LC4G1D2N                      3563
#define CLC4GLS0_D2T                  3564
#define LC4G1D2T                      3565
#define CLC4GLS0_D3N                  3566
#define LC4G1D3N                      3567
#define CLC4GLS0_D3T                  3568
#define LC4G1D3T                      3569
#define CLC4GLS0_D4N                  3570
#define LC4G1D4N                      3571
#define CLC4GLS0_D4T                  3572
#define LC4G1D4T                      3573
#define CLC4GLS1                      3574
#define CLC4GLS1_D1N                  3575
#define LC4G2D1N                      3576
#define CLC4GLS1_D1T                  3577
#define LC4G2D1T                      3578
#define LC4G2D2N                      3579
#define CLC4GLS1_D2N                  3580
#define LC4G2D2T                      3581
#define CLC4GLS1_D2T                  3582
#define CLC4GLS1_D3N                  3583
#define LC4G2D3N                      3584
#define LC4G2D3T                      3585
#define CLC4GLS1_D3T                  3586
#define CLC4GLS1_D4N                  3587
#define LC4G2D4N                      3588
#define CLC4GLS1_D4T                  3589
#define LC4G2D4T                      3590
#define CLC4GLS2                      3591
#define CLC4GLS2_D1N                  3592
#define LC4G3D1N                      3593
#define CLC4GLS2_D1T                  3594
#define LC4G3D1T                      3595
#define LC4G3D2N                      3596
#define CLC4GLS2_D2N                  3597
#define LC4G3D2T                      3598
#define CLC4GLS2_D2T                  3599
#define CLC4GLS2_D3N                  3600
#define LC4G3D3N                      3601
#define CLC4GLS2_D3T                  3602
#define LC4G3D3T                      3603
#define LC4G3D4N                      3604
#define CLC4GLS2_D4N                  3605
#define LC4G3D4T                      3606
#define CLC4GLS2_D4T                  3607
#define CLC4GLS3                      3608
#define CLC4GLS3_G4D1N                3609
#define LC4G4D1N                      3610
#define LC4G4D1T                      3611
#define CLC4GLS3_G4D1T                3612
#define LC4G4D2N                      3613
#define CLC4GLS3_G4D2N                3614
#define LC4G4D2T                      3615
#define CLC4GLS3_G4D2T                3616
#define CLC4GLS3_G4D3N                3617
#define LC4G4D3N                      3618
#define CLC4GLS3_G4D3T                3619
#define LC4G4D3T                      3620
#define LC4G4D4N                      3621
#define CLC4GLS3_G4D4N                3622
#define LC4G4D4T                      3623
#define CLC4GLS3_G4D4T                3624
#define STATUS_SHAD                   3625
#define C_SHAD                        3626
#define DC_SHAD                       3627
#define Z_SHAD                        3628
#define WREG_SHAD                     3629
#define BSR_SHAD                      3630
#define PCLATH_SHAD                   3631
#define FSR0L_SHAD                    3632
#define FSR0H_SHAD                    3633
#define FSR1L_SHAD                    3634
#define FSR1H_SHAD                    3635
#define STKPTR                        3636
#define TOSL                          3637
#define TOSH                          3638

#endif // _PIC16F1619_H_
